
{
  "tuneRev": "0.2.0",
  "dampMPC": "0.17",
  "_dampMPC_note": "This is the amount of seconds into the future that the desired angle will be smoothed.  Smaller value results in more steering response AND more steering noise",
  "dampTime": "0.0",
  "_dampTime_note": "This is the amount of seconds into the past that the actual angle will be smoothed.  Smaller value results in more noise, but LESS response.",
  "advanceSteer": "0.0", 
  "_advanceSteer_note": "This is the amount of increase or decrease from 1.0 for steering angle adjustment.  (-0.05 --> 0.95 * angle)",
  "polyDamp": "0.25",
  "_polyDamp_note": "This is the amount of seconds into the future that the projected lane error will be smoothed.  Smaller value increases response to lane centering AND increases noise",
  "polyFactor": "0.3",
  "_polyFactor_note": "This is the **multiplier** that converts projected lane error into a steering angle adjustment.  Smaller values result in less centering effort, Larger values can cause increasing oscillation.",
  "polyReact": "0.5",
  "_polyReact_note": "This is the ratio of desired angle that comes from ** the Fast Angle and Slow Angle outputs of the model**.  At 0.0, the average of Slow and Fast is used, -0.5 will use ONLY Slow Angle, and +0.5 will use ONLY Fast Angle.",
  "reactMPC": "0.25",
  "_reactMPC_note": "This is the amount of seconds into the future that the desired angle will be projected.  This is used to account for delay in the steering control commands and for the delay caused by smoothing",
  "angleFactor": "1.0",
  "_angleFactor_note": "Similar to advanceSteer, but not currently used",
  "angleOffset": "1",
  "_angleOffset_note": "not currently used",
  "lateralOffset": "1",
  "_lateralOffset_note": "not currently used",
  "angleBias": "1",
  "_angleBias_note": "not currently used",
  "useOptimize": "1",
  "_useOptimize_note": "This is an option (1 or 0) to consider the direction of the last torque request in the blending of the lane center values.",
  "useMinimize": "1",
  "_useMinimize_note": "This is an option (1 or 0) to consider the noise level from left and right in the blending of the lane center values."
}
